{
  "bam": [
    {
      "review" : "Austin and Brady do a great job. I trust them more than any other shop - I even bring my car in from WI to BAM. The last time I was in, they recommended a cheaper fix for my older vehicle rather than an expensive option I was hoping to avoid. I waited in the lobby and the fix was complete within 30 min. I would highly recommend BAM to anyone interested in high quality work and parts, great customer service, and competitive prices."
    },
    {
      "review": "Excellent shop-- took my car in for an AC recharge and general look-over before a cross-country drive. Appointment made quickly and accomplished just as fast. Austin is efficient and professional-- no condescension or overselling. The waiting space is far more quiet and relaxing than other shops I've been to, where you feel like you're in the middle of everything. I would return."
    },
    {
      "review": "I am a transplant from Iowa and had a hard time finding a mechanic I could trust. I found this is Austin! Honest, friendly, reasonable. I highly recommend this shop."
    },
    {
      "review": "What a great experience I've had with the services that I have received from Bam Automotive. I have been doing business here for almost 2 years with no complaints. They keep my older vehicles road worthy and dependable."
    },
    {
      "review": "BAM Automotive is awesome.  Brady and Austin are both very knowledgeable mechanics, and do spectacular work.  I will be bringing my car to them from now on."
    },
    {
      "review": "They have done work on my car and I have been very happy. Great service and good guys."
    },
    {
      "review": "BAM Automotive isn't your average automotive repair shop. Austin and Brady are experts in their field. You can sense their years of experience in the conversation when you get your estimate. They don't take short cuts or use inferior parts and products. You'll walk away having had the highest quality workmanship on your vehicle and you'll be a more educated consumer. No coupons, no up-sells, no BS. Just good, honest, hard working guys running a superior shop. You won't be disappointed."
    },
    {
      "review": "I can personally say Brady and Austin are the guys you want want working on your car ! Brady is one the the smartest techs I was able to work with and Austin was one of my teachers at the best tech college in the Midwest."
    },
    {
      "review": "Austin does a great job and has so many years of experience. Great customer service with a focus on using the right parts and doing the job right."
    },
    {
      "review": "Such a great shop! Full of seriously knowledgeable people who pride themselves in quality work and honest prices!!!"
    },
    {
      "review": "I've been working with Austin for years and I've never been disappointed with his service. He's honest and totally trustworthy - you never feel like he's trying to push you to fix something that doesn't actually need to be fixed."
    }
  ]
}